{
  "Projects": [
    {
      "title": "Time Off Manager",
      "subtitle": "Java, Spring MVC, Materialize UI",
      "description": "I created a web application to track vacation and personal days for a small business. I built the application to move a small business from manually keeping track of time off by hand to a web application. The web application stores data with the NoSQL database DynamoDB and is hosted with AWS. The backend server is written in Java. The application is in use today!"
    },
    {
      "title": "Instagram Clone",
      "subtitle": "Python, Flask, React JS, Bash",
      "description": "I was a member of a team that created a clone of Instagram in Flask. The project was done twice. Once with server side rendering and once with client side rendering. The client side version was made with a REST API and React JS. This allowed us to include features such as infinite scroll. Both versions replicate Instagram and allow users to post, comment, like, and follow other users and posts. Users can also create and delete their account. This was created in EECS 485 - Web Systems at the University of Michigan."
    },
    {
      "title": "Spotify Playlist Creator",
      "subtitle": "Python, Flask, React JS, Bootstrap",
      "description": "I created a web application to track vacation and personal days for a small business. I built the application to move a small business from manually keeping track of time off by hand to a web application. The web application stores data with the NoSQL database DynamoDB and is hosted with AWS. The backend server is written in Java. The application is in use today!"
    },
    {
      "title": "Spotify Playlist Creator",
      "subtitle": "Java, Spring MVC, Bootstrap",
      "description": "I used the Spotify API to create a web app that creates a Spotify playlist with the user's top songs from a certain time period. The user can chose between short, meduim, and long term and a playlist will be created and added to their Spotify library. The web app can be found at playlist.andrewjohnson.io."
    },
    {
      "title": "Lead Management System",
      "subtitle": "Java, Spring MVC, Bootstrap",
      "description": "I created a web application to take inputted customer information and store it securely in a NoSQL database. The information is accessed through a web interface."
    },
    {
      "title": "Personal Website",
      "subtitle": "HTML, CSS, Bootstrap",
      "description": "I created this static single page website to display my resume and other information online. After many iterations I taught myself how to setup a personal website with GitHub Pages and Google Domains. This was my first experience creating a website. Additionally, I have created similar websites for other students at Michigan."
    },
    {
      "title": "Penetration Test",
      "subtitle": "Aircrack, Nmap, Netcat, Bash, Wireshark",
      "description": "I was part of a team that used various computer security tools to penetration test a sample company's computer network. We hacked into their wifi network, sent spoofing emails, and found sensitive information on a sample company's server. This was a school project in the class EECS 388 - Introduction to Computer Security at the University of Michigan."
    },
    {
      "title": "Android Budget Tracker App",
      "subtitle": "Java",
      "description": "I created a budget tracking app for Android in Java. Users can create budget categories and add transactions that are tracked and stored in the device's internal memory. This was a school project in the class EECS 285 - A Programming Language at the University of Michigan."
    },
    {
      "title": "Language Classifier and Text Preprocesser",
      "subtitle": "Python",
      "description": "I created a python program to process text and predict the language of the text. The program used training data to calculate probable languages for the test data. It correctly predicted the language of 297 out of 300 data sets. Finally, tokenization can be performed on the text with stopwords and tags removed. This was part of a school project in EECS 486 - Information Retrieval and Web Search at the University of Michigan."
    },
    {
      "title": "Relational Database",
      "subtitle": "C++",
      "description": "I created a command line relational database in C++. The relational database supported common SQL commands such as CREATE, INSERT INTO, DELETE FROM, and JOIN as well as other commands GENERATE INDEX, PRINT, and REMOVE. The proram was written with space and time restrictions. This was created in EECS 281 - Data Structures and Algorithms at the University of Michigan."
    },
    {
      "title": "Computer Forensics",
      "subtitle": "John the Ripper, Autopsy, Python, Tor",
      "description": "I was part of a team that used various computer forensics tools to analyze and create a digital timeline of a suspects digital actions. We used autopsy to view hard drive contents to find hidden and encrypted files and python to find a secret online forum by brute force. This was part of a school project in EECS 388 - Introduction to Computer Security at the University of Michigan."
    },
    {
      "title": "Euchre Simulator",
      "subtitle": "C++",
      "description": "I created a command line program to simulate the card game Euchre. Up to 4 human players can play with the remaining positions filled by a computer \"player\". The focus of the project was on object orientated programming. This was a school project in the class EECS 280 - Introductory Data Structures at the University of Michigan."
    },
    {
      "title": "New Proj",
      "subtitle": "C++",
      "description": "I created a command line program to simulate the card game Euchre. Up to 4 human players can play with the remaining positions filled by a computer \"player\". The focus of the project was on object orientated programming. This was a school project in the class EECS 280 - Introductory Data Structures at the University of Michigan."
    }
  ],
  "Education": [
    {
      "title": "University of Michigan",
      "subtitle": "Computer Science Engineering | May 2020 | 3.86/4.00 GPA",
      "description": "At Michigan I have had the opportunity to take many interesting classes and pursue many of my interests. Some of my favorite classes I have taken are EECS 485 Web Systems, EECS 388 Introduction to Computer Security, EECS 486 Information Retrieval and Web Search, EECS 281 Data Structures and Algorithms, EECS 370 Introduction to Computer Organization, SPACE 101 Rocket Science, and ENVIRON 120 National Parks. Additionally, I have won 1 IM Broomball championship."
    }
  ],
  "Work Experience": [
    {
      "title": "Apple",
      "subtitle": "Incoming Software Engineering Intern",
      "description": "I am very excited about my next opportunity at Apple this upcoming summer. I will be a member of the Apple Maps team."
    },
    {
      "title": "Amazon",
      "subtitle": "Software Development Engineering Intern",
      "description": "Last summer, Summer 2018, I had the opportunity to intern at Amazon as a Software Development Engineering Intern. I spent the summer in Seattle, Washington on the Finance Tech team at Amazon. I had my first experience with full stack web development at Amazon and had the opportunity to build a prototype full stack web application. I designed the application and presented my design to my team during a design review. I then built the application throughout the internship as I experienced the day to day life of a software engineer. At the end of my internship I presented what I created to my team as they could determine the feasibility of building a full scale version of what I created."
    },
    {
      "title": "Sigma Engineering Solutions",
      "subtitle": "Engineering Intern",
      "description": "I had the opportunity to intern at Sigma Engineering Solutions in Summer 2016 and Summer 2017. I worked as an Engineering Intern at Sigma assistanting full time engineers with various tasks. I built 3D models in SolidWorks of demolition projects for use in bidding and planning the demolition. I drafted constructions plans in AutoCAD and performed quantity calculations with Microsoft Excel. Sigma provided me a valuable experience in an engineering environment."
    },
    {
      "title": "UNLV Entertainment Engineering",
      "subtitle": "Research Assistant",
      "description": "I gained first hand experience in a research setting during Summer 2015. I worked with undergraduate students at UNLV in Las Vegas as they did research on various projects such as the STEM Based Learning and Dancing Drone project. I tested and helped design a STEM Based Learning product targeted for younger students to increase interest in the STEM fields. I also participated in the Dancing Drone project during my internship."
    }
  ]
}
