{
  "Projects": [
    {
      "title": "Time Off Manager",
      "subtitle": "Java, Python (Flask), React JS, Material UI",
      "description": "I built a web application to move a small business from manually keeping track of personal and vacation days by hand to a web application. Users can create and modify time off taken by employees. Time off is automatically accrued through the application removing the need for manually counting days. The application stores data in a MySQL database hosted with AWS. The backend server and REST API is written in Python using the Flask framework and the front end uses React. Since the application is in use today, I have had the opportunity to perform many software engineering, project management, and DevOps tasks such as requirements elicitation, user interviews, implementation, beta testing, support, and bug fixes."
    },
    {
      "title": "Instagram Clone",
      "subtitle": "Python (Flask), React JS, Bash",
      "description": "I was a member of a team that created a clone of Instagram in Flask. The project was done twice. Once with server side rendering and once with client side rendering. The client side version was made with a REST API and React JS. This allowed us to include features such as infinite scroll. Both versions replicate Instagram and allow users to post, comment, like, and follow other users and posts. Users can also create and delete their account. This was created in EECS 485 - Web Systems at the University of Michigan."
    },
    {
      "title": "ChoreBoard Mobile Application",
      "subtitle": "React Native, Python (Flask), Expo, MySQL",
      "description": "My team built an iOS mobile application to make household chores a better experience. We built an application that allows parents to assign chores to their kids. Once the kids complete the chores they are given rewards set by their parents. The application was built with a React Native frontend and a Python backend. See the final demo video <a href=\"https://youtu.be/qalUfjE0TKM\">here</a>."
    },
    {
      "title": "Exxtreme Snowboarding Adventure",
      "subtitle": "Vue JS, Vue Bootstrap, NPM",
      "description": "Exxtreme Snowboarding Adventure is an online game simulating a snowboarding experience in Ann Arbor, Michigan. I was a member of a 4 person team that built the game with the Vue JS framework. After building the game we conducted user interviews to gather feedback on the project. "
    },
    {
      "title": "MapReduce Implementation",
      "subtitle": "Python",
      "description": "I was member of team that implemented a fault tolerant MapReduce framework in Python. The program received and delegated tasks to multiple other \"machines's\". If a machine \"died\" during processing the master program would reassign the task to another machine. I gained experience with Python threads, processes, and sockets during the project."
    },
    {
      "title": "Spotify Playlist Creator",
      "subtitle": "Java, Python (Flask), React JS, Bootstrap",
      "description": "I used the Spotify API to create a web app that creates a Spotify playlist with the user's top songs from a selected time period. The user can chose between short, medium, and long term and a playlist will be created and added to their Spotify library. The web app can be found at <a href=\"http://playlist.andrewjohnson.io\">http://playlist.andrewjohnson.io</a>."
    },
    {
      "title": "Lead Management System",
      "subtitle": "Java (Spring), Bootstrap",
      "description": "I created a web application to take inputted customer information and store it securely in a NoSQL database. The information is accessed through a web interface."
    },
    {
      "title": "Music Genre Classfier",
      "subtitle": "Python",
      "description": "I worked with a team to create a musical genre classifier with data from the Spotify API. We used the Spotify API to gather audio features and audio metrics about a selection of tracks. We used bayes probability and the probability density function (PDF) to calculate the probability of a track containing certain audio features. 8 genres were included the data set and we achieved an accuracy of 54%."
    },
    {
      "title": "Personal Website",
      "subtitle": "HTML, CSS, React JS, Bootstrap",
      "description": "I created this static single page website to display my resume and other information online. I used React Routing for client side routing and created a system that reads website content from a JSON file to eliminate difficult HTML updates. I taught myself how to setup a personal website with GitHub Pages and Google Domains. This was my first experience creating a website and I have created a similar website for another student at the University of Michigan."
    },
    {
      "title": "Penetration Test",
      "subtitle": "Aircrack, Nmap, Netcat, Bash, Wireshark",
      "description": "I was part of a team that used various computer security tools to penetration test a sample company's computer network. We hacked into their wifi network, sent spoofing emails, and found sensitive information on a sample company's server. This was a school project in the class EECS 388 - Introduction to Computer Security at the University of Michigan."
    },
    {
      "title": "Android Budget Tracker App",
      "subtitle": "Java",
      "description": "I created a budget tracking app for Android in Java. Users can create budget categories and add transactions that are tracked and stored in the device's internal memory. This was a school project in the class EECS 285 - A Programming Language at the University of Michigan."
    },
    {
      "title": "Language Classifier and Text Preprocesser",
      "subtitle": "Python",
      "description": "I created a python program to process text and predict the language of the text. The program used training data to calculate probable languages for the test data. It correctly predicted the language of 297 out of 300 data sets. Finally, tokenization can be performed on the text with stopwords and tags removed. This was part of a school project in EECS 486 - Information Retrieval and Web Search at the University of Michigan."
    },
    {
      "title": "Relational Database",
      "subtitle": "C++",
      "description": "I created a command line relational database in C++. The relational database supported common SQL commands such as CREATE, INSERT INTO, DELETE FROM, and JOIN as well as other commands GENERATE INDEX, PRINT, and REMOVE. The proram was written with space and time restrictions. This was created in EECS 281 - Data Structures and Algorithms at the University of Michigan."
    },
    {
      "title": "Computer Forensics",
      "subtitle": "John the Ripper, Autopsy, Python, Tor",
      "description": "I was part of a team that used various computer forensics tools to analyze and create a digital timeline of a suspects digital actions. We used autopsy to view hard drive contents to find hidden and encrypted files and python to find a secret online forum by brute force. This was part of a school project in EECS 388 - Introduction to Computer Security at the University of Michigan."
    },
    {
      "title": "Euchre Simulator",
      "subtitle": "C++",
      "description": "I created a command line program to simulate the card game Euchre. Up to 4 human players can play with the remaining positions filled by a computer \"player\". The focus of the project was on object orientated programming. This was a school project in the class EECS 280 - Introductory Data Structures at the University of Michigan."
    }
  ],
  "Education": [
    {
      "title": "University of Michigan",
      "subtitle": "B.S.E Computer Science Engineering  | 3.9/4.0 GPA",
      "description": "I graduated from the University of Michigan Summa Cum Laude in May of 2020. At Michigan I had the opportunity to take many interesting classes. Some of my favorite classes were Web Systems, Software Engineering, Computer Security, Information Retrieval and Web Search, Data Structures and Algorithms, Rocket Science, and National Parks. Additionally, I led my IM Broomball to a championship. After a disappointing regular season, we won 5 straight games to claim the title."
    }
  ],
  "Work Experience": [
    {
      "title": "Apple",
      "subtitle": "Software Engineering Intern",
      "description": "In the summer of 2019, I interned at Apple on the Apple Maps team as Software Engineering Intern. I worked on the data platform team and created multiple data pipelines to transform and store data. Additionally, I analyzed existing data and made recommendations to improve current processes. Finally, I had the opportunity to participate in the Agile development model by leading daily standup meetings and performing time estimations."
    },
    {
      "title": "Amazon",
      "subtitle": "Software Development Engineering Intern",
      "description": "Summer 2018, I had the opportunity to intern at Amazon as a Software Development Engineering Intern. I spent the summer in Seattle, Washington on the Finance Tech team at Amazon. I had my first experience with full stack web development at Amazon and had the opportunity to build a prototype full stack web application. I designed the application and presented my design to my team during a design review. I then built the application throughout the internship as I experienced the day to day life of a software engineer. At the end of my internship I presented what I created to my team as they could determine the feasibility of building a full scale version of what I created."
    },
    {
      "title": "Sigma Engineering Solutions",
      "subtitle": "Engineering Intern",
      "description": "I had the opportunity to intern as an Engineering Intern at Sigma Engineering Solutions in the summers of 2016 and 2017. During my internships I assisted full time engineers with various tasks. I built 3D models in SolidWorks of demolition projects for use in bidding and planning demolitions. I drafted construction plans in AutoCAD and performed quantity calculations with Microsoft Excel. Sigma provided me a valuable experience in an engineering environment."
    },
    {
      "title": "UNLV Entertainment Engineering",
      "subtitle": "Research Assistant",
      "description": "I gained first hand experience in a research setting in the summer of 2015. I worked with undergraduate students at UNLV in Las Vegas as they performed research on various projects such as the STEM Based Learning and Dancing Drone project. I tested and helped design a STEM Based Learning product targeted for younger students to increase interest in the STEM fields."
    }
  ]
}